//задача 1
let x = prompt("Введіть ваше перше число");
let y = prompt("Введіть ваше друге число");
for (i=x; i<=y;  i++) {
    x = x + (x + 1);
    console.log(x);
}
alert("Інформацію про додавання можете подивитися у логах бо я ше не такий крутий шо вивести це тут")

// задача 2
let z = prompt("Введіть ваше число");
if (z == 0) {
    alert("Число довінює нулю")
} else if (z < 0) {
    alert("Число є відємне")
} else {
    alert("Число є додатнім")
}

//Задача 3
do {
  var q = prompt("скільки буде 8*9 = ? ")
} while (q!= 72);
alert("Молодець правильно!")
